In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([3,4,5,6])

In [4]:
obj

0    3
1    4
2    5
3    6
dtype: int64

In [5]:
obj.values

array([3, 4, 5, 6])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [8]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [10]:
pd.DataFrame(data,columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [11]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [12]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [13]:
frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

In [14]:
frame['eastern'] = frame.state == 'Ohio'

In [15]:
frame

    state  year  pop  eastern
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

In [16]:
frame['eastern'] = 'True'

In [17]:
frame

    state  year  pop eastern
0    Ohio  2000  1.5    True
1    Ohio  2001  1.7    True
2    Ohio  2002  3.6    True
3  Nevada  2001  2.4    True
4  Nevada  2002  2.9    True
5  Nevada  2003  3.2    True

In [19]:
frame['year']= 2000

In [20]:
frame

    state  year  pop eastern
0    Ohio  2000  1.5    True
1    Ohio  2000  1.7    True
2    Ohio  2000  3.6    True
3  Nevada  2000  2.4    True
4  Nevada  2000  2.9    True
5  Nevada  2000  3.2    True

In [21]:
del frame['year']

In [22]:
frame.columns

Index(['state', 'pop', 'eastern'], dtype='object')

In [23]:
frame.values

array([['Ohio', 1.5, 'True'],
       ['Ohio', 1.7, 'True'],
       ['Ohio', 3.6, 'True'],
       ['Nevada', 2.4, 'True'],
       ['Nevada', 2.9, 'True'],
       ['Nevada', 3.2, 'True']], dtype=object)

In [24]:
obj = pd.Series(range(3),index = ['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [25]:
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [26]:
dup_labels.append(pd.Index(['ku']))

Index(['foo', 'foo', 'bar', 'bar', 'ku'], dtype='object')